<?php defined('SYSPATH') OR die('No direct script access.');

return array(

	'alpha'         => 'Значение поля :field должно содержать только буквы',
	'alpha_dash'    => 'Значение поля :field должно содержать только буквы, цифры и тире',
	'alpha_numeric' => 'Значение поля :field должно содержать только буквы, цифры',
	'color'         => 'Значение поля :field должно быть цветом',
	'credit_card'   => 'Значение поля :field должно быть номером кредитной карты',
	'date'          => 'Значение поля :field должно быть датой',
	'decimal'       => 'Значение поля :field должно быть десятичной с точностью :param2 знака',
	'digit'         => 'Значение поля :field должно быть цифрой',
	'email'         => 'Значение поля :field должно быть адресом электронной почты',
	'email_domain'  => 'Значение поля :field должно содержать корректный домен электронной почты',
	'equals'        => 'Значение поля :field должно быть равно :param2',
	'exact_length'  => 'Значение поля :field должно по количеству символов должно соответствовать :param2',
	'in_array'      => 'Значение поля :field должно быть одним из доступных вариантов',
	'ip'            => 'Значение поля :field должно быть ip адресом',
	'matches'       => 'Значение поля :field должно быть таким же как :param3',
	'min_length'    => 'Значение поля :field должно быть меньше :param2 символов',
	'max_length'    => 'Значение поля :field не должно превышать :param2 символов',
	'not_empty'     => 'Значение поля :field не должно быть пустым',
	'numeric'       => 'Значение поля :field должно быть числом',
	'phone'         => 'Значение поля :field должно быть телефоном',
	'range'         => 'Значение поля :field должно быть в промежутке от :param2 до :param3',
	'regex'         => 'Значение поля :field не соответствует указанному формату',
	'url'           => 'Значение поля :field должно быть ссылкой',

);
